Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_sci.h
/** @defgroup SCI_Reception_Type_Values  SCI Reception type values
  * @{
  */
#define HAL_SCI_RECEPTION_STANDARD          (0x00000000U)             /*!< Standard reception                       */
#define HAL_SCI_RECEPTION_TOIDLE            (0x00000001U)             /*!< Reception till completion or IDLE event  */
#define HAL_SCI_RECEPTION_TORTO             (0x00000002U)             /*!< Reception till completion or RTO event   */
#define HAL_SCI_RECEPTION_TOCHARMATCH       (0x00000003U)             /*!< Reception till completion or CM event    */
/**
  * @}
  */

/** @defgroup SCI_RxEvent_Type_Values  SCI RxEvent type values
  * @{
  */
#define HAL_SCI_RXEVENT_TC                  (0x00000000U)             /*!< RxEvent linked to Transfer Complete event */
#define HAL_SCI_RXEVENT_HT                  (0x00000001U)             /*!< RxEvent linked to Half Transfer event     */
#define HAL_SCI_RXEVENT_IDLE                (0x00000002U)             /*!< RxEvent linked to IDLE event              */
/**
  * @}
  */

/**
  * @}
  */
 
/* Exported macros -----------------------------------------------------------*/
/** @defgroup SCI_Exported_Macros SCI Exported Macros
  * @{
  */

/** @brief Reset SCI handle state.
  * @param  __HANDLE__ SCI handle.
  * @retval None
  */
#if (USE_HAL_SCI_REGISTER_CALLBACKS == 1)
#define __HAL_SCI_RESET_HANDLE_STATE(__HANDLE__)  do{                                                 \
                                                        (__HANDLE__)->gState = HAL_SCI_STATE_RESET;   \
                                                        (__HANDLE__)->RxState = HAL_SCI_STATE_RESET;  \
                                                        (__HANDLE__)->MspInitCallback = NULL;         \
                                                        (__HANDLE__)->MspDeInitCallback = NULL;       \
                                                      } while(0U)
#else
#define __HAL_SCI_RESET_HANDLE_STATE(__HANDLE__)  do{                                                 \
                                                       (__HANDLE__)->gState = HAL_SCI_STATE_RESET;    \
                                                       (__HANDLE__)->RxState = HAL_SCI_STATE_RESET;   \
                                                     } while(0U)
#endif /*USE_HAL_SCI_REGISTER_CALLBACKS */

/** @brief  Flushes the SCI DR register
  * @param  __HANDLE__ specifies the SCI Handle.
  *         SCI Handle selects the SCIx or SCIy peripheral
  *         (SCI,SCI availability and x,y values depending on device).
  */
#define __HAL_SCI_FLUSH_DRREGISTER(__HANDLE__) ((__HANDLE__)->Instance->DR)

/** @brief  Clears the specified SCI pending flag.
  * @param  __HANDLE__ specifies the SCI Handle.
  *         SCI Handle selects the SCIx or SCIy peripheral
  *         (SCI,SCI availability and x,y values depending on device).
  * @param  __FLAG__ specifies the flag to check.
  *          This parameter can be any combination of the following values:
  *            @arg SCI_FLAG_CTS:  CTS Change flag .
  *            @arg SCI_FLAG_LBD:  LIN Break detection flag.
  *            @arg SCI_FLAG_TC:   Transmission Complete flag.
  *            @arg SCI_FLAG_RXNE: Receive data register not empty flag.
  *
  * @note   PE (Parity error), FE (Framing error), NE (Noise error), ORE (Overrun
  *          error) and IDLE (Idle line detected) flags are cleared by software
  *          sequence: a read operation to USART_SR register followed by a read
  *          operation to USART_DR register.
  * @note   RXNE flag can be also cleared by a read to the USART_DR register.
  * @note   TC flag can be also cleared by software sequence: a read operation to
  *          USART_SR register followed by a write operation to USART_DR register.
  * @note   TXE flag is cleared only by a write to the USART_DR register.
  *
  * @retval None
  */
#define __HAL_SCI_CLEAR_FLAG(__HANDLE__, __FLAG__) ((__HANDLE__)->Instance->SR = ~(__FLAG__))

/** @brief  Clear the SCI EOB pending flag.
  * @param  __HANDLE__ specifies the SCI Handle.
  * @retval None
  */
#define __HAL_SCI_CLEAR_EOBFLAG(__HANDLE__) ((__HANDLE__)->Instance->SR &= (~USART_SR_EOBF))

/** @brief  Clear the SCI RTOF pending flag.
  * @param  __HANDLE__ specifies the SCI Handle.
  * @retval None
  */
#define __HAL_SCI_CLEAR_RTOFLAG(__HANDLE__) ((__HANDLE__)->Instance->SR &= (~USART_SR_RTOF))

/** @brief  Clears the SCI PE pending flag.
  * @param  __HANDLE__ specifies the SCI Handle.
  *         SCI Handle selects the SCIx or SCIy peripheral
  *         SCI,SCI availability and x,y values depending on device).
  * @retval None
  */
#define __HAL_SCI_CLEAR_PEFLAG(__HANDLE__)      \
  do{                                           \
    __IO uint32_t tmpreg = 0x00U;               \
    tmpreg = (__HANDLE__)->Instance->SR;        \
    tmpreg = (__HANDLE__)->Instance->DR;        \
    UNUSED(tmpreg);                             \
  } while(0U)

/** @brief  Clears the SCI FE pending flag.
  * @param  __HANDLE__ specifies the SCI Handle.
  *         SCI Handle selects the SCIx or SCIy peripheral
  *         SCI,SCI availability and x,y values depending on device).
  * @retval None
  */
#define __HAL_SCI_CLEAR_FEFLAG(__HANDLE__) __HAL_SCI_CLEAR_PEFLAG(__HANDLE__)

/** @brief  Clears the SCI NE pending flag.
  * @param  __HANDLE__ specifies the SCI Handle.
  *         SCI Handle selects the SCIx or SCIy peripheral
  *         SCI,SCI availability and x,y values depending on device).
  * @retval None
  */
#define __HAL_SCI_CLEAR_NEFLAG(__HANDLE__) __HAL_SCI_CLEAR_PEFLAG(__HANDLE__)

/** @brief  Clears the SCI ORE pending flag.
  * @param  __HANDLE__ specifies the SCI Handle.
  *         SCI Handle selects the SCIx or SCIy peripheral
  *         SCI,SCI availability and x,y values depending on device).
  * @retval None
  */
#define __HAL_SCI_CLEAR_OREFLAG(__HANDLE__) __HAL_SCI_CLEAR_PEFLAG(__HANDLE__)

/** @brief  Clears the SCI IDLE pending flag.
  * @param  __HANDLE__ specifies the SCI Handle.
  *         SCI Handle selects the SCIx or SCIy peripheral
  *         SCI,SCI availability and x,y values depending on device).
  * @retval None
  */
#define __HAL_SCI_CLEAR_IDLEFLAG(__HANDLE__) __HAL_SCI_CLEAR_PEFLAG(__HANDLE__)

/** @brief  Check whether the specified SCI flag is set or not.
  * @param  __HANDLE__ specifies the SCI Handle
  * @param  __FLAG__ specifies the flag to check.
  *        This parameter can be one of the following values:
  *            @arg @ref SCI_FLAG_RTOF   Receiver timeout flag
  *            @arg @ref SCI_FLAG_EOBF   Block end flag
  *            @arg @ref SCI_FLAG_RXFF   RXFIFO Full flag
  *            @arg @ref SCI_FLAG_TXFE   TXFIFO Empty flag
  *            @arg @ref SCI_FLAG_TXFT   TXFIFO threshold flag
  *            @arg @ref SCI_FLAG_RXFT   RXFIFO threshold flag
  *            @arg @ref SCI_FLAG_ABRRQ  Auto BRR request flag
  *            @arg @ref SCI_FLAG_ABRE   Auto BRR error flag
  *            @arg @ref SCI_FLAG_ABRF   Auto BRR detection flag
  *            @arg @ref SCI_FLAG_CTS    CTS flag
  *            @arg @ref SCI_FLAG_LBD    LIN break detection flag
  *            @arg @ref SCI_FLAG_TXE    Transmit data register empty flag
  *            @arg @ref SCI_FLAG_TC     Transmission complete flag
  *            @arg @ref SCI_FLAG_RXNE   Read data register not empty flag
  *            @arg @ref SCI_FLAG_IDLE   IDLE flag
  *            @arg @ref SCI_FLAG_ORE    Overrun error flag
  *            @arg @ref SCI_FLAG_NE     Noising Error flag
  *            @arg @ref SCI_FLAG_FE     Framing Error flag
  *            @arg @ref SCI_FLAG_PE     Parity Error flag
  * @retval The new state of __FLAG__ (TRUE or FALSE).
  */
#define __HAL_SCI_GET_FLAG(__HANDLE__, __FLAG__) (((__HANDLE__)->Instance->SR & (__FLAG__)) == (__FLAG__))

/** @brief  Enable the specified SCI interrupt.
  * @param  __HANDLE__ specifies the SCI Handle.
  * @param  __INTERRUPT__ specifies the SCI interrupt source to enable.
  *          This parameter can be one of the following values:
  *            @arg @ref SCI_IT_LBD   LBD interrupt
  *            @arg @ref SCI_IT_EOB   EOB interrupt
  *            @arg @ref SCI_IT_RTO   RTO interrupt
  *            @arg @ref SCI_IT_CTS   CTS interrupt
  *            @arg @ref SCI_IT_RXFF  RXFIFO Full interrupt
  *            @arg @ref SCI_IT_TXFE  TXFIFO Empty interrupt
  *            @arg @ref SCI_IT_RXFT  RXFIFO threshold interrupt
  *            @arg @ref SCI_IT_TXFT  TXFIFO threshold interrupt
  *            @arg @ref SCI_IT_TXE   Transmit Data Register empty interrupt
  *            @arg @ref SCI_IT_TC    Transmission complete interrupt
  *            @arg @ref SCI_IT_RXNE  Receive Data register not empty interrupt
  *            @arg @ref SCI_IT_IDLE  Idle line detection interrupt
  *            @arg @ref SCI_IT_PE    Parity Error interrupt
  *            @arg @ref SCI_IT_ERR   Error interrupt(Frame error, noise error, overrun error)
  * @retval None
  */
#define __HAL_SCI_ENABLE_IT(__HANDLE__, __INTERRUPT__)  ( \
                                                         ((((uint8_t)(__INTERRUPT__)) >> 5U) == SCI_CR1_REG_INDEX)?((__HANDLE__)->Instance->CR1 |= (1U << ((__INTERRUPT__) & SCI_IT_MASK))): \
                                                         ((((uint8_t)(__INTERRUPT__)) >> 5U) == SCI_CR2_REG_INDEX)?((__HANDLE__)->Instance->CR2 |= (1U << ((__INTERRUPT__) & SCI_IT_MASK))): \
                                                         ((__HANDLE__)->Instance->CR3 |= (1U << ((__INTERRUPT__) & SCI_IT_MASK))))

/** @brief  Disable the specified SCI interrupt.
  * @param  __HANDLE__ specifies the SCI Handle.
  * @param  __INTERRUPT__ specifies the SCI interrupt source to enable.
  *          This parameter can be one of the following values:
  *            @arg @ref SCI_IT_LBD   LBD interrupt
  *            @arg @ref SCI_IT_EOB   EOB interrupt
  *            @arg @ref SCI_IT_RTO   RTO interrupt
  *            @arg @ref SCI_IT_CTS   CTS interrupt
  *            @arg @ref SCI_IT_RXFF  RXFIFO Full interrupt
  *            @arg @ref SCI_IT_TXFE  TXFIFO Empty interrupt
  *            @arg @ref SCI_IT_RXFT  RXFIFO threshold interrupt
  *            @arg @ref SCI_IT_TXFT  TXFIFO threshold interrupt
  *            @arg @ref SCI_IT_TXE   Transmit Data Register empty interrupt
  *            @arg @ref SCI_IT_TC    Transmission complete interrupt
  *            @arg @ref SCI_IT_RXNE  Receive Data register not empty interrupt
  *            @arg @ref SCI_IT_IDLE  Idle line detection interrupt
  *            @arg @ref SCI_IT_PE    Parity Error interrupt
  *            @arg @ref SCI_IT_ERR   Error interrupt(Frame error, noise error, overrun error)
  * @retval None
  */
#define __HAL_SCI_DISABLE_IT(__HANDLE__, __INTERRUPT__) ( \
                                                         ((((uint8_t)(__INTERRUPT__)) >> 5U) == SCI_CR1_REG_INDEX)?((__HANDLE__)->Instance->CR1 &= ~(1U << ((__INTERRUPT__) & SCI_IT_MASK))): \
                                                         ((((uint8_t)(__INTERRUPT__)) >> 5U) == SCI_CR2_REG_INDEX)?((__HANDLE__)->Instance->CR2 &= ~(1U << ((__INTERRUPT__) & SCI_IT_MASK))): \
                                                         ((__HANDLE__)->Instance->CR3 &= ~(1U << ((__INTERRUPT__) & SCI_IT_MASK))))

/** @brief  Check whether the specified SCI interrupt has occurred or not.
  * @param  __HANDLE__ specifies the SCI Handle.
  * @param  __INTERRUPT__ specifies the SCI interrupt source to check.
  *          This parameter can be one of the following values:
  *            @arg @ref SCI_IT_LBD   LBD interrupt
  *            @arg @ref SCI_IT_EOB   EOB interrupt
  *            @arg @ref SCI_IT_RTO   RTO interrupt
  *            @arg @ref SCI_IT_CTS   CTS interrupt
  *            @arg @ref SCI_IT_RXFF  RXFIFO Full interrupt
  *            @arg @ref SCI_IT_TXFE  TXFIFO Empty interrupt
  *            @arg @ref SCI_IT_RXFT  RXFIFO threshold interrupt
  *            @arg @ref SCI_IT_TXFT  TXFIFO threshold interrupt
  *            @arg @ref SCI_IT_TXE   Transmit Data Register empty interrupt
  *            @arg @ref SCI_IT_TC    Transmission complete interrupt
  *            @arg @ref SCI_IT_RXNE  Receive Data register not empty interrupt
  *            @arg @ref SCI_IT_IDLE  Idle line detection interrupt
  *            @arg @ref SCI_IT_PE    Parity Error interrupt
  *            @arg @ref SCI_IT_ERR   Error interrupt(Frame error, noise error, overrun error)
  * @retval The new state of __INTERRUPT__ (SET or RESET).
  */
#define __HAL_SCI_GET_IT(__HANDLE__, __INTERRUPT__) ((((__HANDLE__)->Instance->SR & (1U << ((__INTERRUPT__)>> 8U))) != RESET) ? SET : RESET)

/** @brief  Check whether the specified SCI interrupt has occurred or not.
  * @param  __HANDLE__ specifies the SCI Handle.
  * @param  __INTERRUPT__ specifies the SCI interrupt source to enable.
  *          This parameter can be one of the following values:
  *            @arg @ref SCI_IT_LBD   LBD interrupt
  *            @arg @ref SCI_IT_EOB   EOB interrupt
  *            @arg @ref SCI_IT_RTO   RTO interrupt
  *            @arg @ref SCI_IT_CTS   CTS interrupt
  *            @arg @ref SCI_IT_RXFF  RXFIFO Full interrupt
  *            @arg @ref SCI_IT_TXFE  TXFIFO Empty interrupt
  *            @arg @ref SCI_IT_RXFT  RXFIFO threshold interrupt
  *            @arg @ref SCI_IT_TXFT  TXFIFO threshold interrupt
  *            @arg @ref SCI_IT_TXE   Transmit Data Register empty interrupt
  *            @arg @ref SCI_IT_TC    Transmission complete interrupt
  *            @arg @ref SCI_IT_RXNE  Receive Data register not empty interrupt
  *            @arg @ref SCI_IT_IDLE  Idle line detection interrupt
  *            @arg @ref SCI_IT_PE    Parity Error interrupt
  *            @arg @ref SCI_IT_ERR   Error interrupt(Frame error, noise error, overrun error)
  * @retval None
  */
#define __HAL_SCI_GET_IT_SOURCE(__HANDLE__, __INTERRUPT__) ((((((((uint8_t)(__INTERRUPT__)) >> 5U) == SCI_CR1_REG_INDEX) ? (__HANDLE__)->Instance->CR1 : \
                                                              (((((uint8_t)(__INTERRUPT__)) >> 5U) == SCI_CR2_REG_INDEX) ? (__HANDLE__)->Instance->CR2 : \
                                                              (__HANDLE__)->Instance->CR3)) & (1U << (((uint16_t)(__INTERRUPT__)) & SCI_IT_MASK))) != RESET) ? SET : RESET)

/** @brief  Set a specific SCI request flag.
  * @param  __HANDLE__ specifies the SCI Handle.
  * @param  __REQ__ specifies the request flag to set.
  *          This parameter can be one of the following values: 
  *            @arg @ref SCI_SENDBREAK_REQUEST Send Break Request
  *            @arg @ref SCI_RXDATA_FLUSH_REQUEST Receive Data flush Request
  *            @arg @ref SCI_TXDATA_FLUSH_REQUEST Transmit data flush Request
  *
  * @retval None
  */
#define __HAL_SCI_SEND_REQ(__HANDLE__, __REQ__)      ((__HANDLE__)->Instance->CR1 |= (uint16_t)(__REQ__))


/** @brief  Enable SCI.
  * @param  __HANDLE__ specifies the SCI Handle.
  * @retval None
  */
#define __HAL_SCI_ENABLE(__HANDLE__)                 ((__HANDLE__)->Instance->CR1 |= USART_CR1_UE)

/** @brief  Disable SCI.
  * @param  __HANDLE__ specifies the SCI Handle.
  * @retval None
  */
#define __HAL_SCI_DISABLE(__HANDLE__)                ((__HANDLE__)->Instance->CR1 &= ~USART_CR1_UE)

/** @brief  Enable CTS flow control
  * @note   This macro allows to enable CTS hardware flow control for a given SCI instance,
  *         without need to call HAL_SCI_Init() function.
  *         As involving direct access to USART registers, usage of this macro should be fully endorsed by user.
  * @note   As macro is expected to be used for modifying CTS Hw flow control feature activation, without need
  *         for SCI instance Deinit/Init, following conditions for macro call should be fulfilled :
  *           - SCI instance should have already been initialised (through call of HAL_SCI_Init() )
  *           - macro could only be called when corresponding SCI instance is disabled (i.e __HAL_SCI_DISABLE(__HANDLE__))
  *             and should be followed by an Enable macro (i.e __HAL_SCI_ENABLE(__HANDLE__)).
  * @param  __HANDLE__ specifies the SCI Handle.
  *         The Handle Instance can be any SCIx (supporting the HW Flow control feature).
  *         It is used to select the SCI peripheral (SCI availability and x value depending on device).
  * @retval None
  */
#define __HAL_SCI_HWCONTROL_CTS_ENABLE(__HANDLE__)        \
  do{                                                      \
    SET_BIT((__HANDLE__)->Instance->CR3, USART_CR3_CTSE);  \
    (__HANDLE__)->Init.HwFlowCtl |= USART_CR3_CTSE;        \
  } while(0U)

/** @brief  Disable CTS flow control
  * @note   This macro allows to disable CTS hardware flow control for a given SCI instance,
  *         without need to call HAL_SCI_Init() function.
  *         As involving direct access to USART registers, usage of this macro should be fully endorsed by user.
  * @note   As macro is expected to be used for modifying CTS Hw flow control feature activation, without need
  *         for SCI instance Deinit/Init, following conditions for macro call should be fulfilled :
  *           - SCI instance should have already been initialised (through call of HAL_SCI_Init() )
  *           - macro could only be called when corresponding SCI instance is disabled (i.e __HAL_SCI_DISABLE(__HANDLE__))
  *             and should be followed by an Enable macro (i.e __HAL_SCI_ENABLE(__HANDLE__)).
  * @param  __HANDLE__ specifies the SCI Handle.
  *         The Handle Instance can be any SCIx (supporting the HW Flow control feature).
  *         It is used to select the SCI peripheral (SCI availability and x value depending on device).
  * @retval None
  */
#define __HAL_SCI_HWCONTROL_CTS_DISABLE(__HANDLE__)        \
  do{                                                       \
    CLEAR_BIT((__HANDLE__)->Instance->CR3, USART_CR3_CTSE); \
    (__HANDLE__)->Init.HwFlowCtl &= ~(USART_CR3_CTSE);      \
  } while(0U)

/** @brief  Enable RTS flow control
  *         This macro allows to enable RTS hardware flow control for a given SCI instance,
  *         without need to call HAL_SCI_Init() function.
  *         As involving direct access to USART registers, usage of this macro should be fully endorsed by user.
  * @note   As macro is expected to be used for modifying RTS Hw flow control feature activation, without need
  *         for SCI instance Deinit/Init, following conditions for macro call should be fulfilled :
  *           - SCI instance should have already been initialised (through call of HAL_SCI_Init() )
  *           - macro could only be called when corresponding SCI instance is disabled (i.e __HAL_SCI_DISABLE(__HANDLE__))
  *             and should be followed by an Enable macro (i.e __HAL_SCI_ENABLE(__HANDLE__)).
  * @param  __HANDLE__ specifies the SCI Handle.
  *         The Handle Instance can be any SCIx (supporting the HW Flow control feature).
  *         It is used to select the SCI peripheral (SCI availability and x value depending on device).
  * @retval None
  */
#define __HAL_SCI_HWCONTROL_RTS_ENABLE(__HANDLE__)       \
  do{                                                     \
    SET_BIT((__HANDLE__)->Instance->CR3, USART_CR3_RTSE); \
    (__HANDLE__)->Init.HwFlowCtl |= USART_CR3_RTSE;       \
  } while(0U)

/** @brief  Disable RTS flow control
  *         This macro allows to disable RTS hardware flow control for a given SCI instance,
  *         without need to call HAL_SCI_Init() function.
  *         As involving direct access to USART registers, usage of this macro should be fully endorsed by user.
  * @note   As macro is expected to be used for modifying RTS Hw flow control feature activation, without need
  *         for SCI instance Deinit/Init, following conditions for macro call should be fulfilled :
  *           - SCI instance should have already been initialised (through call of HAL_SCI_Init() )
  *           - macro could only be called when corresponding USART instance is disabled (i.e __HAL_SCI_DISABLE(__HANDLE__))
  *             and should be followed by an Enable macro (i.e __HAL_SCI_ENABLE(__HANDLE__)).
  * @param  __HANDLE__ specifies the SCI Handle.
  *         The Handle Instance can be any SCIx (supporting the HW Flow control feature).
  *         It is used to select the SCI peripheral (SCI availability and x value depending on device).
  * @retval None
  */
#define __HAL_SCI_HWCONTROL_RTS_DISABLE(__HANDLE__)       \
  do{                                                      \
    CLEAR_BIT((__HANDLE__)->Instance->CR3, USART_CR3_RTSE);\
    (__HANDLE__)->Init.HwFlowCtl &= ~(USART_CR3_RTSE);     \
  } while(0U)

/** @brief  Send Auto-Baud Rate Request.
  * @param  __HANDLE__ specifies the SCI Handle.
  * @retval None
  */
#define __HAL_SCI_SEND_AUTOBAUD_REQ(__HANDLE__)     ((__HANDLE__)->Instance->SR |= (uint16_t)(USART_SR_ABRRQ))

/**
  * @}
  */

